# Example 1
# 1.Ввести предложение, состоящее из двух слов.
# 2.Поменять местами слова, добавить "!" в начало и конец слова.
# 3.Разделить 3 символами (" ", "!", " ")
# 4.Пример: "hello world" --> "world ! hello"
# 5.Задание выполнить разными способами форматирования.


# ========================================================================================================================
# # Variant1:
# ========================================================================================================================


predlojenie="Hello Minsk"
peremennaya=" ! "   #создаем строкавую переменную
predlojenie1 = predlojenie[:5] + peremennaya + predlojenie[6:]   #соединяем слова
predlojenie2 = predlojenie1.split()  # разделяем предложение на слова
predlojenie2[0], predlojenie2[1], predlojenie2[2]= predlojenie2[2], predlojenie2[1], predlojenie2[0] #меняем слова местами
assert predlojenie2 == ['Minsk', '!', 'Hello']  #проверка
predlojenie3= " ".join(predlojenie2)            #преобразуем обратно в строку
assert predlojenie3 =="Minsk ! Hello"           #проверка
print(predlojenie3)

# ======================================================================================================================
# Variant2
# ========================================================================================================================
predlojenie3="Hello Minsk"
predlojenie4=predlojenie3.split()   # разделяем предложение на слова
a=predlojenie4[0]                   #по индексу 0 приравнивам переменную
b=predlojenie4[1]                   # по индексу 1 приравнивам переменную
predlojenie5=b+" ! "+a              # соединиям в предложение
assert predlojenie5=="Minsk ! Hello" #проверка
end2=predlojenie5.split(" ",2)      #разделяем 3 символами (" ", "!", " ")
print(predlojenie5)


# ======================================================================================================================
# Variant 3
# ======================================================================================================================
from itertools import chain
predlojenie6="Hello Minsk"
a=list(predlojenie6)                              #преобразуем в список
b=a[:]                                            #делаем копию
a[:5],a[5],a[6:]=b[6:11],[" ! "],b[:5]            # при помощи срезов меняем слова местами
from itertools import chain                       # импорт
a = list(chain(*a))                               # раскрываем список в списке
end3= "".join(a)                                  #преобразуем обратно в строку
assert end3=="Minsk ! Hello"
print(end3)



